[{"id":"7f8bed7b-41b2-41c8-9147-1f9f0e5566f4","name":"Maria Saari","address":"Keltamotie 7, 01300 Vantaa","email":null,"phone":null,"url":null,"icon":"pawprint.fill","latitude":60.29126,"longitude":25.027044,"image":null,"dogs":[{"id":"bc168ca7-951a-4cbf-bd65-1f5f2295319d","name":"Iita","species":"Pinscher","birthdate":"2016-07-25","sex":"female","description":"Energetic registered Pinscher girl Iita is looking for a new home. Iita receives the guests kindly, sniffs the newcomer and then continues her own activities. Iita gets along with other dogs and cats if the cat is used to the dog. Iita suffers from separation anxiety, cries and barks after people when she is alone, for this reason living in an apartment building is out of the question for the girl. Walks briskly on a leash, likes to be ahead of a person and excitedly explores all smells. He's a really nice jogging buddy because he also has the patience to listen to commands and doesn't jump here and there while jogging. In the car, the girl travels well, when the car starts and stops, she is eager to beep and would already be on her way to new adventures. Would love to follow his person everywhere and be involved in everything. You get frustrated easily if you don't get daily activation and enough exercise, the frustration manifests itself as restlessness. We are looking for an active and exercising home for Iita in a detached house, and the future owner must commit to taking care of the dog's daily exercise and activation, as well as training. Due to her lively and energetic nature, the girl would be well suited to a hobby where she could release her energy. It would be good for the future home to have experience in training a dog suffering from separation anxiety, so that Iita learns to be at home calmly even on her own. It will not be given as the first dog or to a family with small children, the dog is not used to very small children. Iita is almost clean inside and in a foster home in Pukkila, where you can get to know the girl as agreed. frustration manifests as restlessness. We are looking for an active and exercising home for Iita in a detached house, and the future owner must commit to taking care of the dog's daily exercise and activation, as well as training. Due to her lively and energetic nature, the girl would be well suited to a hobby where she could release her energy. It would be good for the future home to have experience in training a dog suffering from separation anxiety, so that Iita learns to be at home calmly even on her own. It will not be given as the first dog or to a family with small children, the dog is not used to very small children. Iita is almost clean inside and in a foster home in Pukkila, where you can get to know the girl as agreed. frustration manifests as restlessness. We are looking for an active and exercising home for Iita in a detached house, and the future owner must commit to taking care of the dog's daily exercise and activation, as well as training. Due to her lively and energetic nature, the girl would be well suited to a hobby where she could release her energy. It would be good for the future home to have experience in training a dog suffering from separation anxiety, so that Iita learns to be at home calmly even on her own. It will not be given as the first dog or to a family with small children, the dog is not used to very small children. Iita is almost clean inside and in a foster home in Pukkila, where you can get to know the girl as agreed. We are looking for an active and exercising home for Iita in a detached house, and the future owner must commit to taking care of the dog's daily exercise and activation, as well as training. Due to her lively and energetic nature, the girl would be well suited to a hobby where she could release her energy. It would be good for the future home to have experience in training a dog suffering from separation anxiety, so that Iita learns to be at home calmly even on her own. It will not be given as the first dog or to a family with small children, the dog is not used to very small children. Iita is almost clean inside and in a foster home in Pukkila, where you can get to know the girl as agreed. We are looking for an active and exercising home for Iita in a detached house, and the future owner must commit to taking care of the dog's daily exercise and activation, as well as training. Due to her lively and energetic nature, the girl would be well suited to a hobby where she could release her energy. It would be good for the future home to have experience in training a dog suffering from separation anxiety, so that Iita learns to be at home calmly even on her own. It will not be given as the first dog or to a family with small children, the dog is not used to very small children. Iita is almost clean inside and in a foster home in Pukkila, where you can get to know the girl as agreed. Due to her lively and energetic nature, the girl would be well suited to a hobby where she could release her energy. It would be good for the future home to have experience in training a dog suffering from separation anxiety, so that Iita learns to be at home calmly even on her own. It will not be given as the first dog or to a family with small children, the dog is not used to very small children. Iita is almost clean inside and in a foster home in Pukkila, where you can get to know the girl as agreed. Due to her lively and energetic nature, the girl would be well suited to a hobby where she could release her energy. It would be good for the future home to have experience in training a dog suffering from separation anxiety, so that Iita learns to be at home calmly even on her own. It will not be given as the first dog or to a family with small children, the dog is not used to very small children. Iita is almost clean inside and in a foster home in Pukkila, where you can get to know the girl as agreed.","shelter_id":"7f8bed7b-41b2-41c8-9147-1f9f0e5566f4","images":[{"id":"4a380159-a214-4f02-83c5-021c97736132","url":"/rails/active_storage/disk/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaDdDVG9JYTJWNVNTSWhNekJ0ZWpKd2JYQnViWGcwWkdFM1lYUTViVFowTTNocGNuZzBNQVk2QmtWVU9oQmthWE53YjNOcGRHbHZia2tpUTJsdWJHbHVaVHNnWm1sc1pXNWhiV1U5SWtscGRHRXRaWFIxTG1wd1p5STdJR1pwYkdWdVlXMWxLajFWVkVZdE9DY25TV2wwWVMxbGRIVXVhbkJuQmpzR1ZEb1JZMjl1ZEdWdWRGOTBlWEJsU1NJUGFXMWhaMlV2YW5CbFp3WTdCbFE2RVhObGNuWnBZMlZmYm1GdFpUb0tiRzlqWVd3PSIsImV4cCI6IjIwMjItMTEtMDVUMTc6MTk6MzguNzIzWiIsInB1ciI6ImJsb2Jfa2V5In19--57baacdc4390c3adea33fbe921044514ecb6a3d9/Iita-etu.jpg","blurhash":"LIH_iFAA%LfO8wR*V?t7.9enD*V["},{"id":"d360d2af-e63e-48d1-a15b-5db834314be3","url":"/rails/active_storage/disk/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaDdDVG9JYTJWNVNTSWhibUZ3ZEdKbllXSTJZelkyWlRjNGRUUnBjV2hzYmpoa1lqRXhNQVk2QmtWVU9oQmthWE53YjNOcGRHbHZia2tpUTJsdWJHbHVaVHNnWm1sc1pXNWhiV1U5SWtscGRHRXRjR0ZoTG1wd1p5STdJR1pwYkdWdVlXMWxLajFWVkVZdE9DY25TV2wwWVMxd1lXRXVhbkJuQmpzR1ZEb1JZMjl1ZEdWdWRGOTBlWEJsU1NJUGFXMWhaMlV2YW5CbFp3WTdCbFE2RVhObGNuWnBZMlZmYm1GdFpUb0tiRzlqWVd3PSIsImV4cCI6IjIwMjItMTEtMDVUMTc6MTk6MzguNzI2WiIsInB1ciI6ImJsb2Jfa2V5In19--dad0a12a0e8004be939f3bf1333f93227b0ce038/Iita-paa.jpg","blurhash":"LJEW5BZ=?=%0DTICDjRkE1k7xtM}"},{"id":"1063f50b-8b69-4c81-a42a-65236bf06c9e","url":"/rails/active_storage/disk/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaDdDVG9JYTJWNVNTSWhZak5wZGpGNWMyeDNlalJwTkdreGRUVnROalIzY25SMGJ6aHRiUVk2QmtWVU9oQmthWE53YjNOcGRHbHZia2tpUldsdWJHbHVaVHNnWm1sc1pXNWhiV1U5SWtscGRHRXRjMmwyZFM1cWNHY2lPeUJtYVd4bGJtRnRaU285VlZSR0xUZ25KMGxwZEdFdGMybDJkUzVxY0djR093WlVPaEZqYjI1MFpXNTBYM1I1Y0dWSklnOXBiV0ZuWlM5cWNHVm5CanNHVkRvUmMyVnlkbWxqWlY5dVlXMWxPZ3BzYjJOaGJBPT0iLCJleHAiOiIyMDIyLTExLTA1VDE3OjE5OjM4LjczNVoiLCJwdXIiOiJibG9iX2tleSJ9fQ==--387264122d39f06ae266688ee1fd0b1caf37020c/Iita-sivu.jpg","blurhash":"LGJHm$4n?u8wDOV@IUM{_3xu9aRk"}]}]},{"id":"3589925b-f880-4671-8587-5e6955a6d99a","name":"HESY ry","address":"Muonamiehentie 7, 00390 Helsinki","email":null,"phone":"050 414 0000","url":"http://www.hesy.fi/","icon":"house","latitude":60.23112,"longitude":24.85837,"image":{"id":"171f8d13-7e17-403c-bfe4-e9570741c194","url":"/rails/active_storage/disk/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaDdDVG9JYTJWNVNTSWhaV2x2TXpWNWJHZHRjemhxZW5KdE5HOXlOWE5tWlRCNU1HeDJPQVk2QmtWVU9oQmthWE53YjNOcGRHbHZia2tpUVdsdWJHbHVaVHNnWm1sc1pXNWhiV1U5SW1obGMza3Rjbmt1YW5Cbklqc2dabWxzWlc1aGJXVXFQVlZVUmkwNEp5ZG9aWE41TFhKNUxtcHdad1k3QmxRNkVXTnZiblJsYm5SZmRIbHdaVWtpRDJsdFlXZGxMMnB3WldjR093WlVPaEZ6WlhKMmFXTmxYMjVoYldVNkNteHZZMkZzIiwiZXhwIjoiMjAyMi0xMS0wNVQxNzoxOTozOC43NDZaIiwicHVyIjoiYmxvYl9rZXkifX0=--3b4fa144ea7c23984edb5ee15f4a4c9149fcb872/hesy-ry.jpg","blurhash":"L^Kei;xakCof~pslV@j?t7s:bIWX"},"dogs":[{"id":"885b598e-6a33-43b3-815a-c2732e0b00b4","name":"Milla","species":"Multiracial","birthdate":"2014-01-01","sex":"female","description":"Beautiful Milla returned to the association to find a home. Milla is a very energetic girl who needs plenty of exercise, training and activation every day. The girl pulls on the leash and this problem has started to be worked out in the foster home. Makes good contact and listens to commands, is very interested in approaching dogs, however does not show aggressive signs, is more excited about other dogs. Cars or bikes passing by while running can rev up the Milla and try to attack them. Milla is very close to people and really enjoys the company of people, when she is alone she barks, but she hasn't done any damage. Very interested in different smells, so Milla could very well fit into a hobby that requires nose work. Has its own watchdog and barks to announce the arrival of guests. You might jump against the newcomers, and you can unintentionally hurt yourself with your eagerness. Not placed in a family with children due to energy. Milla is looking for an adult home in a detached house, in a quiet residential area, and the new home should have a fenced yard where the girl could not only jog but also unleash her passion for running. The future home must commit to taking care of the dog's daily plenty of exercise, activation and training. The future home is expected to have experience with strong-natured dogs, not to be given away as the first dog. Milla is in a foster home in Vihti, where you can get to know the girl as agreed.","shelter_id":"3589925b-f880-4671-8587-5e6955a6d99a","images":[{"id":"3b6f75bc-f372-42f8-8068-5713f990436c","url":"/rails/active_storage/disk/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaDdDVG9JYTJWNVNTSWhabWQ0YmpONlp6QnlNV0Y2ZUdaemNUUXdNbUp2Y1dKMk16WnBOd1k2QmtWVU9oQmthWE53YjNOcGRHbHZia2tpUjJsdWJHbHVaVHNnWm1sc1pXNWhiV1U5SWsxcGJHeGhMV2x6ZEhVdWFuQm5JanNnWm1sc1pXNWhiV1VxUFZWVVJpMDRKeWROYVd4c1lTMXBjM1IxTG1wd1p3WTdCbFE2RVdOdmJuUmxiblJmZEhsd1pVa2lEMmx0WVdkbEwycHdaV2NHT3daVU9oRnpaWEoyYVdObFgyNWhiV1U2Q214dlkyRnMiLCJleHAiOiIyMDIyLTExLTA1VDE3OjE5OjM4Ljc2M1oiLCJwdXIiOiJibG9iX2tleSJ9fQ==--9ce1bbdd3dee31113c4cb529c1edf7740b30b530/Milla-istu.jpg","blurhash":"LBE39tSjDgrp^%xb%2%MR3%2-;%M"},{"id":"c49e7212-d86c-4828-8f09-ce30a097dbfe","url":"/rails/active_storage/disk/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaDdDVG9JYTJWNVNTSWhZV1Z1YTJnemVXa3haR3RwWkdSNk5EbHhjMnBxWkRSallXOW9OZ1k2QmtWVU9oQmthWE53YjNOcGRHbHZia2tpUldsdWJHbHVaVHNnWm1sc1pXNWhiV1U5SWsxcGJHeGhMWEJoWVM1cWNHY2lPeUJtYVd4bGJtRnRaU285VlZSR0xUZ25KMDFwYkd4aExYQmhZUzVxY0djR093WlVPaEZqYjI1MFpXNTBYM1I1Y0dWSklnOXBiV0ZuWlM5cWNHVm5CanNHVkRvUmMyVnlkbWxqWlY5dVlXMWxPZ3BzYjJOaGJBPT0iLCJleHAiOiIyMDIyLTExLTA1VDE3OjE5OjM4Ljc3MloiLCJwdXIiOiJibG9iX2tleSJ9fQ==--f6ad8bbbe2a3cd4f3784cc4bd50784fe71623b54/Milla-paa.jpg","blurhash":"LJDvZhIpDNX9Ios:snaeR-xZIpoJ"},{"id":"a10d9232-4c96-4f84-b59d-0138c3e71c27","url":"/rails/active_storage/disk/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaDdDVG9JYTJWNVNTSWhjV3RoWm1ob2VYUTNkVGx4YmpoMWNUWnRhR3R3Tm1GdWNYVjVNQVk2QmtWVU9oQmthWE53YjNOcGRHbHZia2tpVDJsdWJHbHVaVHNnWm1sc1pXNWhiV1U5SWsxcGJHeGhMWE5wZG5WcmRYWmhMbXB3WnlJN0lHWnBiR1Z1WVcxbEtqMVZWRVl0T0NjblRXbHNiR0V0YzJsMmRXdDFkbUV1YW5CbkJqc0dWRG9SWTI5dWRHVnVkRjkwZVhCbFNTSVBhVzFoWjJVdmFuQmxad1k3QmxRNkVYTmxjblpwWTJWZmJtRnRaVG9LYkc5allXdz0iLCJleHAiOiIyMDIyLTExLTA1VDE3OjE5OjM4Ljc3OVoiLCJwdXIiOiJibG9iX2tleSJ9fQ==--846402cce1d2ddfc4c39881e5e9c6ca344c8c6e1/Milla-sivukuva.jpg","blurhash":"L6Dvx~05?OM%T2%1D-o?Olx@wSxr"},{"id":"39b2b83d-ed1e-434e-bc25-9e6532a8f93b","url":"/rails/active_storage/disk/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaDdDVG9JYTJWNVNTSWhOV1poWlRock5XNTZPREY2YlRZM01ETnlkM0o1TkhjM2FXb3laUVk2QmtWVU9oQmthWE53YjNOcGRHbHZia2tpUzJsdWJHbHVaVHNnWm1sc1pXNWhiV1U5SWsxcGJHeGhiaTF3WVd4c2J5NXFjR2NpT3lCbWFXeGxibUZ0WlNvOVZWUkdMVGduSjAxcGJHeGhiaTF3WVd4c2J5NXFjR2NHT3daVU9oRmpiMjUwWlc1MFgzUjVjR1ZKSWc5cGJXRm5aUzlxY0dWbkJqc0dWRG9SYzJWeWRtbGpaVjl1WVcxbE9ncHNiMk5oYkE9PSIsImV4cCI6IjIwMjItMTEtMDVUMTc6MTk6MzguNzgzWiIsInB1ciI6ImJsb2Jfa2V5In19--1d8f0d5a4ddb29eb48211b67bc8dba77047da1d2/Millan-pallo.jpg","blurhash":"LHK-zp00_N_3tRafRPf6_N-;D%IU"}]},{"id":"a9cf250a-35d1-4097-8a83-f491fc911873","name":"Arman","species":"German sheppard","birthdate":"2016-07-19","sex":"male","description":"Handsome registered German shepherd Arman is looking for a new home. Arma has a high watchdog, so when guests arrive, the boy has to welcome them in his own style, sniffing carefully. After confirming that the visitors are harmless, he goes on with his own activities. Arman came to the association to look for a home due to a change in the owner's living situation. Arman is a very friendly, loyal, pleasing boy who loves active activities. Needs a firm and consistent owner, easily takes the reins into his own paws if he senses that he is getting the better of things and then living together can become difficult if the dog does not listen to his owner. Not suitable as a first dog. Arman does not get along well with other dogs, so he is only placed as an only pet. On a leash, the boy walks nicely, making contact with his handler, but when he sees other dogs, he starts barking. You still need training for using a leash so that overtaking goes smoothly and jogging becomes a relaxed and enjoyable activity for both of you. In the foster home, we have started to train walking on a leash with other dogs for a short distance, after the initial enthusiasm and noises, he is already able to concentrate on receiving commands and walks most of the time by his owner's side without rushing to other dogs. Being alone has gone without any problems, he hasn't caused havoc or barked on his own, plenty of exercise and activation has helped his calm behavior indoors, allowing you to focus on peaceful rest. Arman has been photographed at the vet, which revealed a suspicion of mild cauda equina syndrome, which does not require any measures at this stage. Hasn't been in pain in a foster home, but Armani is not into any heavy hobby. Exercise and light hobbies, such as nose jobs, are highly recommended. Forest walks are pleasant for the boy, a quiet environment with as few distractions as possible, then Arman is at his best. We are looking for an adult home for Armani in a detached house in a quiet residential area, and the prospective home is expected to have experience with German shepherds or other service dog breeds. The future home must commit to taking care of the dog's daily ample amount of exercise, activation and training. Not placed in a family with children. Arman is clean inside and in a foster home in Vihti where he can get to know the boy as agreed.","shelter_id":"3589925b-f880-4671-8587-5e6955a6d99a","images":[{"id":"6c080506-6053-43e0-9501-f9305c395034","url":"/rails/active_storage/disk/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaDdDVG9JYTJWNVNTSWhlblowTUdnME1ISm1NREI1TVdOaFp6QnZiMmcwTjJobU1uSjZaUVk2QmtWVU9oQmthWE53YjNOcGRHbHZia2tpUldsdWJHbHVaVHNnWm1sc1pXNWhiV1U5SW1GeWJXRnVMV1YwZFM1cWNHY2lPeUJtYVd4bGJtRnRaU285VlZSR0xUZ25KMkZ5YldGdUxXVjBkUzVxY0djR093WlVPaEZqYjI1MFpXNTBYM1I1Y0dWSklnOXBiV0ZuWlM5cWNHVm5CanNHVkRvUmMyVnlkbWxqWlY5dVlXMWxPZ3BzYjJOaGJBPT0iLCJleHAiOiIyMDIyLTExLTA1VDE3OjE5OjM4Ljc5OFoiLCJwdXIiOiJibG9iX2tleSJ9fQ==--e5493d7ffeb4a633de47fbe5e558b45260304ff9/arman-etu.jpg","blurhash":"LBG8_,02%LxuEMxuxWIo.8-;9ZIV"},{"id":"294d0117-bce4-452e-82ef-ed2410b6f014","url":"/rails/active_storage/disk/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaDdDVG9JYTJWNVNTSWhNWGt3Wm5WcWVtZzVZbTFrWTJoclpXRTRlR1J3YlhFMU5EbDRhQVk2QmtWVU9oQmthWE53YjNOcGRHbHZia2tpUjJsdWJHbHVaVHNnWm1sc1pXNWhiV1U5SW1GeWJXRnVMWE5oYTNVdWFuQm5JanNnWm1sc1pXNWhiV1VxUFZWVVJpMDRKeWRoY20xaGJpMXpZV3QxTG1wd1p3WTdCbFE2RVdOdmJuUmxiblJmZEhsd1pVa2lEMmx0WVdkbEwycHdaV2NHT3daVU9oRnpaWEoyYVdObFgyNWhiV1U2Q214dlkyRnMiLCJleHAiOiIyMDIyLTExLTA1VDE3OjE5OjM4LjgwNFoiLCJwdXIiOiJibG9iX2tleSJ9fQ==--0c23fc303fa4a07e56ba44baaf1c6492dfe0fb2d/arman-saku.jpg","blurhash":"LUFiZ3NZNYt7_N9GIUxu?aR+MxW;"},{"id":"72b04265-fe39-44a2-97e9-1fcea27e9c2e","url":"/rails/active_storage/disk/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaDdDVG9JYTJWNVNTSWhhR1F4TlRSb2FYZHVaelp2ZDNrNWFuZHpPR3hrZG5VeFlqTXpjUVk2QmtWVU9oQmthWE53YjNOcGRHbHZia2tpUjJsdWJHbHVaVHNnWm1sc1pXNWhiV1U5SW1GeWJXRnVMWE5wZG5VdWFuQm5JanNnWm1sc1pXNWhiV1VxUFZWVVJpMDRKeWRoY20xaGJpMXphWFoxTG1wd1p3WTdCbFE2RVdOdmJuUmxiblJmZEhsd1pVa2lEMmx0WVdkbEwycHdaV2NHT3daVU9oRnpaWEoyYVdObFgyNWhiV1U2Q214dlkyRnMiLCJleHAiOiIyMDIyLTExLTA1VDE3OjE5OjM4LjgwOFoiLCJwdXIiOiJibG9iX2tleSJ9fQ==--2df56b6c9a059c94003657d3c6e0dfb6f00e41f0/arman-sivu.jpg","blurhash":"L7G8=s02yE^,0vD*wGjC?F-j0KRQ"}]}]},{"id":"1185e926-3014-41d6-be50-9bb7b26c290c","name":"Viikin löytöeläintalo","address":"Koetilantie 13, 00790 Helsinki","email":null,"phone":"040 1980778","url":"https://www.viikinloytoelaintalo.fi/","icon":"house","latitude":60.2228,"longitude":25.02137,"image":{"id":"bdab6cff-b091-4174-ab2e-82b6f80957d1","url":"/rails/active_storage/disk/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaDdDVG9JYTJWNVNTSWhZemg0YVhabU5UaHRaV1UzTVdGNlltOTVOWEpyYW1kaGNuSXljQVk2QmtWVU9oQmthWE53YjNOcGRHbHZia2tpWFdsdWJHbHVaVHNnWm1sc1pXNWhiV1U5SW5acGFXdHBiaTFzYjNsMGIyVnNZV2x1ZEdGc2J5NXFjR2NpT3lCbWFXeGxibUZ0WlNvOVZWUkdMVGduSjNacGFXdHBiaTFzYjNsMGIyVnNZV2x1ZEdGc2J5NXFjR2NHT3daVU9oRmpiMjUwWlc1MFgzUjVjR1ZKSWc5cGJXRm5aUzlxY0dWbkJqc0dWRG9SYzJWeWRtbGpaVjl1WVcxbE9ncHNiMk5oYkE9PSIsImV4cCI6IjIwMjItMTEtMDVUMTc6MTk6MzguODIwWiIsInB1ciI6ImJsb2Jfa2V5In19--28a47c6f20b8185d6c7cad912d632c585cbd38ad/viikin-loytoelaintalo.jpg","blurhash":"LtDA1BofM_j[.Aa}Rjj[krfQofaz"},"dogs":[{"id":"652532a9-6bce-425c-9082-e50f9a6488f3","name":"Floki","species":"Multiracial","birthdate":"2022-07-23","sex":"male","description":"Multiracial Floki is looking for a new home. Floki and his brother Figo are a speedy duo whose owner had to give up due to a change in life situation. Floki is calmer than his brothers and explores a bit further back first until he paws his way into the action. A bit more shy in nature, but can be easily lured into playing. A very friendly boy who gets along with other dogs, a cat and school-aged children. Puppies are placed separately and only with the female dog as a companion to avoid possible later problems. Floki is very studious, has the patience to practice commands better than his brother, can already sit and wait when asked. Travels well in the car in its own transport cabin, is not nauseous or noisy. Floki's parents are 40cm in size and weigh approx. 10-13kg, so the puppies are expected to grow to about the same size. Floki is primarily looking for a home in a terraced house or detached house, and the future home requires a commitment to the puppy's training, socialization and taking care of the dog's daily exercise and activation. The interior cleanliness is already in good shape, but damage can still happen, so the future home must be prepared for this. Floki was brought privately from Poland and the dog has all the necessary documents in order. Floki is in a foster home in Pukkila, where you can get to know the boy as agreed. The interior cleanliness is already in good shape, but damage can still happen, so the future home must be prepared for this. Floki was brought privately from Poland and the dog has all the necessary documents in order. Floki is in a foster home in Pukkila, where you can get to know the boy as agreed. The interior cleanliness is already in good shape, but damage can still happen, so the future home must be prepared for this. Floki was brought privately from Poland and the dog has all the necessary documents in order. Floki is in a foster home in Pukkila, where you can get to know the boy as agreed.","shelter_id":"1185e926-3014-41d6-be50-9bb7b26c290c","images":[{"id":"d41deed1-af50-4376-a2a7-a957fe774c9c","url":"/rails/active_storage/disk/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaDdDVG9JYTJWNVNTSWhlblZqTW1NNWJXd3piMloxZG1Kc1pURnJaRzFoTlhkdVoyZzVjUVk2QmtWVU9oQmthWE53YjNOcGRHbHZia2tpU1dsdWJHbHVaVHNnWm1sc1pXNWhiV1U5SWtac2IydHBMV3RoZEhObExtcHdaeUk3SUdacGJHVnVZVzFsS2oxVlZFWXRPQ2NuUm14dmEya3RhMkYwYzJVdWFuQm5CanNHVkRvUlkyOXVkR1Z1ZEY5MGVYQmxTU0lQYVcxaFoyVXZhbkJsWndZN0JsUTZFWE5sY25acFkyVmZibUZ0WlRvS2JHOWpZV3c9IiwiZXhwIjoiMjAyMi0xMS0wNVQxNzoxOTozOC44NDRaIiwicHVyIjoiYmxvYl9rZXkifX0=--3d114cc7e6eaf3095fab98481f3f1970b4e3f8b8/Floki-katse.jpg","blurhash":"LAFPjCoz?^OU_NRPaKt7_2S6Vus;"},{"id":"d67bc72b-1907-4d0b-9c86-e0445832e53c","url":"/rails/active_storage/disk/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaDdDVG9JYTJWNVNTSWhORzFqZFhjM1ozWjNOWFptTUhJM09IRnRjbmx3WWpZNE9HNXZjQVk2QmtWVU9oQmthWE53YjNOcGRHbHZia2tpUldsdWJHbHVaVHNnWm1sc1pXNWhiV1U5SWtac2IydHBMWEJoWVM1cWNHY2lPeUJtYVd4bGJtRnRaU285VlZSR0xUZ25KMFpzYjJ0cExYQmhZUzVxY0djR093WlVPaEZqYjI1MFpXNTBYM1I1Y0dWSklnOXBiV0ZuWlM5cWNHVm5CanNHVkRvUmMyVnlkbWxqWlY5dVlXMWxPZ3BzYjJOaGJBPT0iLCJleHAiOiIyMDIyLTExLTA1VDE3OjE5OjM4Ljg0N1oiLCJwdXIiOiJibG9iX2tleSJ9fQ==--0a7276bf9451170adcc0f80f6cb0d5ab4535fc91/Floki-paa.jpg","blurhash":"LFGS78xb~URk_MM|N0%Kt8X3M}jY"},{"id":"8df7e030-f4f8-4d7c-90dc-61ede6d1c182","url":"/rails/active_storage/disk/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaDdDVG9JYTJWNVNTSWhjR1JvTWpGclptWjZhbUkwZW0wME9XaHVkbmx4TmpsME1XTjNjQVk2QmtWVU9oQmthWE53YjNOcGRHbHZia2tpUjJsdWJHbHVaVHNnWm1sc1pXNWhiV1U5SWtac2IydHBMWE5wZG5VdWFuQm5JanNnWm1sc1pXNWhiV1VxUFZWVVJpMDRKeWRHYkc5cmFTMXphWFoxTG1wd1p3WTdCbFE2RVdOdmJuUmxiblJmZEhsd1pVa2lEMmx0WVdkbEwycHdaV2NHT3daVU9oRnpaWEoyYVdObFgyNWhiV1U2Q214dlkyRnMiLCJleHAiOiIyMDIyLTExLTA1VDE3OjE5OjM4Ljg1NloiLCJwdXIiOiJibG9iX2tleSJ9fQ==--563ef865d58025420cdf8be578aaa810279afe7f/Floki-sivu.jpg","blurhash":"LCG9E8RC~nRks[oxWDM|NHoxD+Rk"},{"id":"ab359847-f9be-49ba-a4cd-dc7eff897fd4","url":"/rails/active_storage/disk/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaDdDVG9JYTJWNVNTSWhNMjF4YzJOeWVIcHpjWG95T0hsdU1IZG5abTE0WmpOMFptUjJjQVk2QmtWVU9oQmthWE53YjNOcGRHbHZia2tpVzJsdWJHbHVaVHNnWm1sc1pXNWhiV1U5SWxCbGJtNTFkQzFHYkc5cmFTMXFZUzFHYVdkdkxtcHdaeUk3SUdacGJHVnVZVzFsS2oxVlZFWXRPQ2NuVUdWdWJuVjBMVVpzYjJ0cExXcGhMVVpwWjI4dWFuQm5CanNHVkRvUlkyOXVkR1Z1ZEY5MGVYQmxTU0lQYVcxaFoyVXZhbkJsWndZN0JsUTZFWE5sY25acFkyVmZibUZ0WlRvS2JHOWpZV3c9IiwiZXhwIjoiMjAyMi0xMS0wNVQxNzoxOTozOC44NTlaIiwicHVyIjoiYmxvYl9rZXkifX0=--f533ce65f56d80ad6428b406dcb04b9ef17eb4a7/Pennut-Floki-ja-Figo.jpg","blurhash":"LBE{zTM~oyxv4ixtjwkE_3oyN2tS"}]},{"id":"932b09b4-6de6-4f5b-ba1d-9fe28e92eb5f","name":"Minttu","species":"Multiracial","birthdate":"2019-09-02","sex":"female","description":"Sweet multi-breed Minttu is looking for a new home. First of all, I have to say that Minttu is not a normal little dog. Minttu is very shy and it takes time to get used to new people. Minttu doesn't happily jump up to you or curl up in arms, but I still believe that if you find the right person, Minttu can live a very good dog's life if you understand the soul life of a timid dog. The girl gets along with other dogs, a small, calm and social dog friend would be best for Mintu. The girl needs a friend by her side whose example she could follow in normal everyday life. It's also fine with a cat, if the cat is used to dogs. Minttu is not placed in a family with children due to his shyness and lack of familiarity with children. Minttu needs time from its future owner, trust is not won with a couple of treats, but with time. Being alone with the girl goes without any problems, she doesn't do any damage and doesn't make a fuss. Minttu goes outside when asked, but outdoor activities can end very soon when interrupted by a loud noise, in which case the girl's only goal is to get indoors. In the previous home, the walks outside were really short when the dog was almost in a state of panic and the needs came running in circles. For this reason, Mintus had to be given up because life in a busy residential environment is not suitable for the girl and the days were full of stress. Minttu is currently in a foster home in the countryside, where outdoor activities are calmer and the girl is more liberated in a suitable environment. Mintu is looking for an adult home in a detached house in the countryside, and the future home is expected to have experience with very timid dogs. Minttu is clean inside and in a foster home in Pukkila, where you can meet the girl as agreed. In the case of an Ara dog, it would be good to meet the dog at least twice with the future home before the decision to repatriate. The girl is 30 cm tall and weighs a good 5 kg. The mint was originally imported privately from Russia.","shelter_id":"1185e926-3014-41d6-be50-9bb7b26c290c","images":[{"id":"55de3c62-c876-4a55-ae51-141d5485ce18","url":"/rails/active_storage/disk/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaDdDVG9JYTJWNVNTSWhNREJ4YW1WNWFucG9ObkJvTnpkaWRHUjJPR3R3YVRad1pHUnBhZ1k2QmtWVU9oQmthWE53YjNOcGRHbHZia2tpU1dsdWJHbHVaVHNnWm1sc1pXNWhiV1U5SWsxcGJuUjBkUzFyWlhOaExtcHdaeUk3SUdacGJHVnVZVzFsS2oxVlZFWXRPQ2NuVFdsdWRIUjFMV3RsYzJFdWFuQm5CanNHVkRvUlkyOXVkR1Z1ZEY5MGVYQmxTU0lQYVcxaFoyVXZhbkJsWndZN0JsUTZFWE5sY25acFkyVmZibUZ0WlRvS2JHOWpZV3c9IiwiZXhwIjoiMjAyMi0xMS0wNVQxNzoxOTozOC44NzZaIiwicHVyIjoiYmxvYl9rZXkifX0=--2ecc177df66d60719de552ff355f310a92583e63/Minttu-kesa.jpg","blurhash":"L8E:b1aeKHw#~nNHWEspymX8#?Sd"},{"id":"41e19f62-f7b2-455a-a633-3d9d36546059","url":"/rails/active_storage/disk/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaDdDVG9JYTJWNVNTSWhOM2M0YTJjellXVjNjSHBuWnpkM1p6RmtkRE0xY21WemMzSXlaZ1k2QmtWVU9oQmthWE53YjNOcGRHbHZia2tpUjJsdWJHbHVaVHNnWm1sc1pXNWhiV1U5SWsxcGJuUjBkUzF3WVdFdWFuQm5JanNnWm1sc1pXNWhiV1VxUFZWVVJpMDRKeWROYVc1MGRIVXRjR0ZoTG1wd1p3WTdCbFE2RVdOdmJuUmxiblJmZEhsd1pVa2lEMmx0WVdkbEwycHdaV2NHT3daVU9oRnpaWEoyYVdObFgyNWhiV1U2Q214dlkyRnMiLCJleHAiOiIyMDIyLTExLTA1VDE3OjE5OjM4Ljg4NFoiLCJwdXIiOiJibG9iX2tleSJ9fQ==--5bcafad7441c6d3acd4c33b6456c6b9e38efacd2/Minttu-paa.jpg","blurhash":"LIDI%n-;k?D$0hMwaKMx-:oexuj]"},{"id":"659f6dea-5a0f-4b2e-82aa-5fd562e8bcfa","url":"/rails/active_storage/disk/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaDdDVG9JYTJWNVNTSWhOV3gzZUdsNmJYbHhNekptYlc4NU5qRnhNSEp6TUdWallqWTVNUVk2QmtWVU9oQmthWE53YjNOcGRHbHZia2tpU1dsdWJHbHVaVHNnWm1sc1pXNWhiV1U5SWsxcGJuUjBkUzF6YVhaMUxtcHdaeUk3SUdacGJHVnVZVzFsS2oxVlZFWXRPQ2NuVFdsdWRIUjFMWE5wZG5VdWFuQm5CanNHVkRvUlkyOXVkR1Z1ZEY5MGVYQmxTU0lQYVcxaFoyVXZhbkJsWndZN0JsUTZFWE5sY25acFkyVmZibUZ0WlRvS2JHOWpZV3c9IiwiZXhwIjoiMjAyMi0xMS0wNVQxNzoxOTozOC44ODdaIiwicHVyIjoiYmxvYl9rZXkifX0=--2a6d8fe174ae9efe42f0bdaacb4a16f136c15134/Minttu-sivu.jpg","blurhash":"LcF6RqyESiNGDNRjj]R-fiV?jEaz"},{"id":"c62eb546-0873-4166-8f76-4bcac79c0c57","url":"/rails/active_storage/disk/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaDdDVG9JYTJWNVNTSWhPSFUwT1dGNU56WmplRzA1ZG00NE56UndjblV4TTNwbmVqaDJNd1k2QmtWVU9oQmthWE53YjNOcGRHbHZia2tpUzJsdWJHbHVaVHNnWm1sc1pXNWhiV1U5SWsxcGJuUjBkUzF6YVhaMU1pNXFjR2NpT3lCbWFXeGxibUZ0WlNvOVZWUkdMVGduSjAxcGJuUjBkUzF6YVhaMU1pNXFjR2NHT3daVU9oRmpiMjUwWlc1MFgzUjVjR1ZKSWc5cGJXRm5aUzlxY0dWbkJqc0dWRG9SYzJWeWRtbGpaVjl1WVcxbE9ncHNiMk5oYkE9PSIsImV4cCI6IjIwMjItMTEtMDVUMTc6MTk6MzguODk2WiIsInB1ciI6ImJsb2Jfa2V5In19--bad56ec950f4901f3693b3012beb2203be6e99d0/Minttu-sivu2.jpg","blurhash":"LJI=AKD*x^Vs.A0LIUM{.9ogIAbb"}]},{"id":"23c936f3-5e0d-4816-a8cc-0feae27e4ed6","name":"Lilo","species":"Unknown","birthdate":"2019-07-06","sex":"female","description":"Beautiful Lilo arrived at the association looking for a home due to a change in the owner's life situation. Lilo welcomes the guests very kindly, the treats are fine for the girl without being picky. Lilo's pedigree includes husky and amstaff, so she is an athletic and active girl. On a run, Lilo runs very well, does not pull on the leash and does not bark at other dogs. When he sees squirrels and hares, he gets a little excited to pull, but soon calms down to continue his journey. Gets along with other dogs, used to living as the only pet, and if there is a dog friend waiting in the future home, the dogs must meet before the decision to repatriate. Do not place another female dog as a friend to avoid possible problems. There is no experience with cats and no knowledge of how to react to them. Lilo is friendly towards children and knows how to be really nice with children. Traveling by car goes without any problems, there is no fuss and there is no nausea. He casually jumps on board the stranger and carefully examines all the smells. He whines a little when left alone, but then calms down in his own place. Shoes and other smaller loose items such as the remote control should still be put out of sight while you are away, Lilo can chew on them when she is alone on the deck. Allows you to carry out treatment procedures, washing paws and cutting nails is easy. He is used to living in an apartment building, the sounds from the crab do not cause barking. We are looking for a home for Lilo where we commit to take care of the dog's abundant exercise, activation and training needs every day. It would be good for the future home to have dog experience, Lilo is not placed as the first dog. Lilo is clean inside and in a foster home in Vantaa, where you can get to know the girl as agreed.","shelter_id":"1185e926-3014-41d6-be50-9bb7b26c290c","images":[{"id":"32979145-61b8-4277-b34c-0d02f51d912a","url":"/rails/active_storage/disk/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaDdDVG9JYTJWNVNTSWhiV3Q2YUhNNWNHbHBkR0o1YUdkamQyMDBkblpvYnpSamJHZGlOd1k2QmtWVU9oQmthWE53YjNOcGRHbHZia2tpUTJsdWJHbHVaVHNnWm1sc1pXNWhiV1U5SWt4cGJHOHRaWFIxTG1wd1p5STdJR1pwYkdWdVlXMWxLajFWVkVZdE9DY25UR2xzYnkxbGRIVXVhbkJuQmpzR1ZEb1JZMjl1ZEdWdWRGOTBlWEJsU1NJUGFXMWhaMlV2YW5CbFp3WTdCbFE2RVhObGNuWnBZMlZmYm1GdFpUb0tiRzlqWVd3PSIsImV4cCI6IjIwMjItMTEtMDVUMTc6MTk6MzguOTEyWiIsInB1ciI6ImJsb2Jfa2V5In19--2ffb24b7de08a56123408cab84103210f5aa63fb/Lilo-etu.jpg","blurhash":"LAE{kCTItGRi0Ls.V|s=VzbKRoWT"},{"id":"c59fac85-07c3-4210-87a9-6606f2531c1a","url":"/rails/active_storage/disk/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaDdDVG9JYTJWNVNTSWhaRGR6YVdZeGF6ZDRiekpqYVdrNGRUaGlaM04zWkd4d1ptNXlhQVk2QmtWVU9oQmthWE53YjNOcGRHbHZia2tpUTJsdWJHbHVaVHNnWm1sc1pXNWhiV1U5SWt4cGJHOHRjR0ZoTG1wd1p5STdJR1pwYkdWdVlXMWxLajFWVkVZdE9DY25UR2xzYnkxd1lXRXVhbkJuQmpzR1ZEb1JZMjl1ZEdWdWRGOTBlWEJsU1NJUGFXMWhaMlV2YW5CbFp3WTdCbFE2RVhObGNuWnBZMlZmYm1GdFpUb0tiRzlqWVd3PSIsImV4cCI6IjIwMjItMTEtMDVUMTc6MTk6MzguOTIwWiIsInB1ciI6ImJsb2Jfa2V5In19--fcee3346b76a053ba03a4bb2435c689a7d328fa1/Lilo-paa.jpg","blurhash":"L7Dvcgt+Sqng0Mt6N2xuW0oOIXt6"},{"id":"0f9829ba-3044-4077-a67f-5cce56eab8d4","url":"/rails/active_storage/disk/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaDdDVG9JYTJWNVNTSWhNV0ZyYnpGaGJXeGhjM0p2WlhnM1oyZ3plSEJrTURVd2NYSnNZZ1k2QmtWVU9oQmthWE53YjNOcGRHbHZia2tpUldsdWJHbHVaVHNnWm1sc1pXNWhiV1U5SW14cGJHOHRjMmwyZFM1cWNHY2lPeUJtYVd4bGJtRnRaU285VlZSR0xUZ25KMnhwYkc4dGMybDJkUzVxY0djR093WlVPaEZqYjI1MFpXNTBYM1I1Y0dWSklnOXBiV0ZuWlM5cWNHVm5CanNHVkRvUmMyVnlkbWxqWlY5dVlXMWxPZ3BzYjJOaGJBPT0iLCJleHAiOiIyMDIyLTExLTA1VDE3OjE5OjM4LjkyOFoiLCJwdXIiOiJibG9iX2tleSJ9fQ==--8d0e029ceaad2926340379b869778a6444372ae0/lilo-sivu.jpg","blurhash":"L7F~mf+iS]ng0NOWM*xrKQtPD;R$"}]}]},{"id":"a61c415e-9c84-41bf-b6db-bbc1ad31b46f","name":"SEY ry","address":"Lintulahdenkatu 1000500, Helsinki","email":null,"phone":"0207 528 420","url":"https://sey.fi/","icon":"house","latitude":60.18389,"longitude":24.96217,"image":{"id":"c24195ef-c06e-4557-bb67-d1c9f8fdccc7","url":"/rails/active_storage/disk/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaDdDVG9JYTJWNVNTSWhZbWcyYm5vd2VEazNZblE0ZHpNd2JtUjZNMlZwY0RKbVpUQnFaZ1k2QmtWVU9oQmthWE53YjNOcGRHbHZia2tpUDJsdWJHbHVaVHNnWm1sc1pXNWhiV1U5SW5ObGVTMXllUzVxY0djaU95Qm1hV3hsYm1GdFpTbzlWVlJHTFRnbkozTmxlUzF5ZVM1cWNHY0dPd1pVT2hGamIyNTBaVzUwWDNSNWNHVkpJZzlwYldGblpTOXFjR1ZuQmpzR1ZEb1JjMlZ5ZG1salpWOXVZVzFsT2dwc2IyTmhiQT09IiwiZXhwIjoiMjAyMi0xMS0wNVQxNzoxOTozOC45NDRaIiwicHVyIjoiYmxvYl9rZXkifX0=--c63d5fd242931a1f4437df758016af0e360a3328/sey-ry.jpg","blurhash":"LVH2D{]{bc~UOxn1xaofTgxVn#E2"},"dogs":[{"id":"3516d362-13d3-4fb9-b7ef-b23d66270b95","name":"Diego","species":"Bullmastif mix","birthdate":"2015-06-16","sex":"male","description":"Diego, a handsome and friendly bullmastiff mix, pawed at the association to find a home due to a change in his owner's life situation. Diego has a watchman at home, so the foster home receives the guests outside first, after which they are introduced to Diego when they come inside. After examining the guests and finding them harmless, after a while the tail wags and the master is begging for crackers. Diego gets along with other dogs differently, which is why Mr. is placed as the only dog. Life with the cat goes smoothly, sometimes the master tries to get the cat to play with him, but without success. Gets along with school-aged children. In the mornings when the children from the foster home are escorted to school, Diego is excited to be greeted by everyone who goes to school. Friendly block, with which you sometimes need patience and a sense of humor when the object is the sofa in the living room. In the Lord's opinion, he can stretch out on the couch very widely and the others can go wherever there is room. On a leash, Diego mainly walks nicely, can get a little excited to chase after smells, and this Lord has strength. You don't bark at other dogs on a leash, you can only bark back if the other one starts barking. Alone from the Lord is going without any problems, hasn't caused any damage and waits nicely while the others leave. In the car, you also travel nicely in your own place without making a fuss, and you don't get sick. Diego has a special diet that must be followed for the rest of his life. We are looking for a home for Diego, either in a terraced house or a detached house in a quiet residential area, and the future home must commit to taking care of the dog's daily exercise, about the need for activation and training. Not placed as the first dog or in a family with very small children, Diego is used to life with school-aged children. Clean inside.","shelter_id":"a61c415e-9c84-41bf-b6db-bbc1ad31b46f","images":[{"id":"30b39915-4d94-4b14-b676-15c7863a549b","url":"/rails/active_storage/disk/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaDdDVG9JYTJWNVNTSWhibTF2TnpjMGRXeHFOMmxoYTNaMGVqSjFaakp1ZWpsdWFIQmhhZ1k2QmtWVU9oQmthWE53YjNOcGRHbHZia2tpUldsdWJHbHVaVHNnWm1sc1pXNWhiV1U5SWtScFpXZHZMV1YwZFM1cWNHY2lPeUJtYVd4bGJtRnRaU285VlZSR0xUZ25KMFJwWldkdkxXVjBkUzVxY0djR093WlVPaEZqYjI1MFpXNTBYM1I1Y0dWSklnOXBiV0ZuWlM5cWNHVm5CanNHVkRvUmMyVnlkbWxqWlY5dVlXMWxPZ3BzYjJOaGJBPT0iLCJleHAiOiIyMDIyLTExLTA1VDE3OjE5OjM4Ljk2MVoiLCJwdXIiOiJibG9iX2tleSJ9fQ==--c6ddc4e65d3329195609aa89db0535a9bec47f25/Diego-etu.jpg","blurhash":"LNGk,m-pEhR--:$yIARO~qxuM{WB"},{"id":"ae797372-1ab0-4e75-9362-65e57f498218","url":"/rails/active_storage/disk/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaDdDVG9JYTJWNVNTSWhOMjU0ZEhoemRHODFOWFJ4TW5jd2N6Rm5PSFEwY0dZMWJUWXhlZ1k2QmtWVU9oQmthWE53YjNOcGRHbHZia2tpUjJsdWJHbHVaVHNnWm1sc1pXNWhiV1U5SWtScFpXZHZMWE5wZG5VdWFuQm5JanNnWm1sc1pXNWhiV1VxUFZWVVJpMDRKeWRFYVdWbmJ5MXphWFoxTG1wd1p3WTdCbFE2RVdOdmJuUmxiblJmZEhsd1pVa2lEMmx0WVdkbEwycHdaV2NHT3daVU9oRnpaWEoyYVdObFgyNWhiV1U2Q214dlkyRnMiLCJleHAiOiIyMDIyLTExLTA1VDE3OjE5OjM4Ljk2OVoiLCJwdXIiOiJibG9iX2tleSJ9fQ==--8f176f53fb355f583f051b9ace2cfde46110c9b0/Diego-sivu.jpg","blurhash":"LRGRh-AFW?o#.S=zb^tR~Wb^w{W="},{"id":"769a284c-dedd-42b3-87d7-b9787e21f8be","url":"/rails/active_storage/disk/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaDdDVG9JYTJWNVNTSWhhVGxoZG5SdU9IRTROVE5uTm5GbU1URjBjVGw0YW1wa016ZHhad1k2QmtWVU9oQmthWE53YjNOcGRHbHZia2tpU1dsdWJHbHVaVHNnWm1sc1pXNWhiV1U5SW1ScFpXZHZMVzFoYTNWMUxtcHdaeUk3SUdacGJHVnVZVzFsS2oxVlZFWXRPQ2NuWkdsbFoyOHRiV0ZyZFhVdWFuQm5CanNHVkRvUlkyOXVkR1Z1ZEY5MGVYQmxTU0lQYVcxaFoyVXZhbkJsWndZN0JsUTZFWE5sY25acFkyVmZibUZ0WlRvS2JHOWpZV3c9IiwiZXhwIjoiMjAyMi0xMS0wNVQxNzoxOTozOC45NzRaIiwicHVyIjoiYmxvYl9rZXkifX0=--85dd1aff6e08118a79a6019d67a41bbdd440678a/diego-makuu.jpg","blurhash":"LBG*m0og1P4:_4-;t4D%T}XA=YE1"}]},{"id":"7c9e9c6b-6f8f-4aa5-a1f0-451cd4c2a420","name":"Koda","species":"Rottweiler","birthdate":"2021-11-01","sex":"male","description":"Young and energetic rottweiler mix Koda is looking for a home. Koda came to the association to look for a home due to a change in the owner's living situation. Koda is very friendly towards people, welcomes guests cheerfully, may also jump at you, so newcomers should be prepared for this. In addition to rottweilers, Koda's pedigree includes pit bulls, he needs a lot of training and activation to stay happy, Koda is not just a couch potato. Knows some basic commands, but requires a firm and consistent owner to accept commands. Koda doesn't really respect or listen to the tyrant if he feels he's getting even a little bit of a hand in things. He walks quite nicely on the leash until another dog appears in sight, when he starts barking and attacking. Also darts after flying leaves or, inspired by an interesting smell, changes direction to surprise the catcher. Leash use is Koda's biggest problem, and it is worked on daily in the foster home so that jogging runs smoothly in the future. Can be easily motivated with treats or a chew bar in training and contact search. The socialization of the home has remained somewhat incomplete, due to the young age this is also something that can still be corrected. In the foster home, I have met older bitches of the same size jogging together, and the jogging went great. Koda could perfectly read the sign language of the older bitches, so there were no problems. The solitary exercises have started and the short periods have gone without any problems, the time interval is gradually being extended. The boy travels fine in the car, doesn't get sick or make unnecessary noise. We are looking for an adult home for Koda as the only pet in a terraced or detached house in a quiet residential area, and the future home requires a lot of dog and training experience, Koda is not suitable as a first dog. The future home must commit to taking care of the dog's ample amount of exercise, activation and training every day in order to avoid possible problems caused by frustration. Koda would certainly also be suitable for a hobby where you can release your energy and activate your nose and head. Koda is clean inside and in a foster home in Helsinki, where you can get to know the boy as agreed.","shelter_id":"a61c415e-9c84-41bf-b6db-bbc1ad31b46f","images":[{"id":"6f9a3393-c521-4e23-92eb-84ab7baf0bc1","url":"/rails/active_storage/disk/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaDdDVG9JYTJWNVNTSWhkbUUwYkhsMWJ6WmpiSE4wTlhOamFHUXlkVzVuTkROa2FIZ3liZ1k2QmtWVU9oQmthWE53YjNOcGRHbHZia2tpUTJsdWJHbHVaVHNnWm1sc1pXNWhiV1U5SWt0dlpHRXRjR0ZoTG1wd1p5STdJR1pwYkdWdVlXMWxLajFWVkVZdE9DY25TMjlrWVMxd1lXRXVhbkJuQmpzR1ZEb1JZMjl1ZEdWdWRGOTBlWEJsU1NJUGFXMWhaMlV2YW5CbFp3WTdCbFE2RVhObGNuWnBZMlZmYm1GdFpUb0tiRzlqWVd3PSIsImV4cCI6IjIwMjItMTEtMDVUMTc6MTk6MzguOTg2WiIsInB1ciI6ImJsb2Jfa2V5In19--62257b786dae1757688e767c2ebdb7eeee247a5f/Koda-paa.jpg","blurhash":"LbHUtYxr~VkCoMa0bJIUSiRiWYt6"},{"id":"237a1817-532c-4388-8277-c2e598c72215","url":"/rails/active_storage/disk/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaDdDVG9JYTJWNVNTSWhlVzV0ZVRoak1XODFaM1JsZG01NFkyWndjRGczZW5obFlXZ3dkd1k2QmtWVU9oQmthWE53YjNOcGRHbHZia2tpUjJsdWJHbHVaVHNnWm1sc1pXNWhiV1U5SWt0dlpHRXRjRzlwYTJFdWFuQm5JanNnWm1sc1pXNWhiV1VxUFZWVVJpMDRKeWRMYjJSaExYQnZhV3RoTG1wd1p3WTdCbFE2RVdOdmJuUmxiblJmZEhsd1pVa2lEMmx0WVdkbEwycHdaV2NHT3daVU9oRnpaWEoyYVdObFgyNWhiV1U2Q214dlkyRnMiLCJleHAiOiIyMDIyLTExLTA1VDE3OjE5OjM4Ljk5NloiLCJwdXIiOiJibG9iX2tleSJ9fQ==--743823725ca033379097a62bbe47a0ce894d3bab/Koda-poika.jpg","blurhash":"L8Fh@kpdWB_3?wM|sAnN.S~Ao}E2"},{"id":"ddcf702c-3f62-4892-b0b3-8161ee96a631","url":"/rails/active_storage/disk/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaDdDVG9JYTJWNVNTSWhObVo2ZHpKMWJtRTRNWFUzWm5CcmMyRnJkbXQ2YkdZMU9YcDJjd1k2QmtWVU9oQmthWE53YjNOcGRHbHZia2tpUldsdWJHbHVaVHNnWm1sc1pXNWhiV1U5SWt0dlpHRXRkR0ZyWVM1cWNHY2lPeUJtYVd4bGJtRnRaU285VlZSR0xUZ25KMHR2WkdFdGRHRnJZUzVxY0djR093WlVPaEZqYjI1MFpXNTBYM1I1Y0dWSklnOXBiV0ZuWlM5cWNHVm5CanNHVkRvUmMyVnlkbWxqWlY5dVlXMWxPZ3BzYjJOaGJBPT0iLCJleHAiOiIyMDIyLTExLTA1VDE3OjE5OjM4Ljk5OVoiLCJwdXIiOiJibG9iX2tleSJ9fQ==--9dd1b3f1f93c20c100885e9b057fa63a68f200e8/Koda-taka.jpg","blurhash":"LUFYolD*xu-:~qRkxuxa%MofofR*"},{"id":"c3e2f35c-3893-499c-89fa-dc02edc0d48c","url":"/rails/active_storage/disk/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaDdDVG9JYTJWNVNTSWhOMjVpTURVM2IySnFNMlI0ZVc0MGVqVndNM0psWTNVM01YWnFhd1k2QmtWVU9oQmthWE53YjNOcGRHbHZia2tpTzJsdWJHbHVaVHNnWm1sc1pXNWhiV1U5SWt0dlpHRXVhbkJuSWpzZ1ptbHNaVzVoYldVcVBWVlVSaTA0SnlkTGIyUmhMbXB3WndZN0JsUTZFV052Ym5SbGJuUmZkSGx3WlVraUQybHRZV2RsTDJwd1pXY0dPd1pVT2hGelpYSjJhV05sWDI1aGJXVTZDbXh2WTJGcyIsImV4cCI6IjIwMjItMTEtMDVUMTc6MTk6MzkuMDAzWiIsInB1ciI6ImJsb2Jfa2V5In19--ba79d635dcac4fc7cead98e67b02cd519f0394dd/Koda.jpg","blurhash":"LDF#dPxBocxCR%~U^it7cYR+IWIq"}]},{"id":"ace6825a-8460-479a-8cd4-d3cc889c632c","name":"Carlo","species":"Husky mix","birthdate":"2021-06-12","sex":"male","description":"Shy husky mix Carlo is looking for a new home. Carlo is a bit timid towards strangers, needs a little time to get to know him and likes to go at his own pace, treats make getting to know him easier. According to the information, Carlo's pedigree also includes laika, so he is an active young man who enjoys exercise. Gets along with other dogs, most definitely bitches, so Carlo is not placed as a male friend due to possible problems that may arise later. When you gain more self-confidence, cohabitation with another male can become challenging. Also got along with cats who are used to dogs in the foster home. Traveling by car is fine, there is no nausea or noise during the journey. Goes briskly for a run and walks nicely on a leash, some sounds or moving things are still shy. The bitch from the foster home has helped here, from whom Carlo has nicely taken support in exciting situations. In the future home, it would be good to have a social and brave bitch waiting for you, who can help you face new things and wrestle away the bigger energies. The loneliness has gone without any major damage, he likes to move shoes from the shoe shelf to another but has not used them as chew toys. I have never been completely alone in a foster home, but always have dog and cat friends as company. He has also gotten along well with older, already school-aged children, Carlo is not placed in a family with smaller children due to his lack of habit. Carlo is also a tough boy to climb, so the yard fences in the future home should be high enough and protected to prevent climbing over if the dog is kept free in the yard without supervision. Carlo is looking for an adult home with dog experience, either in a terraced house or a detached house in a quiet residential area. The future home must commit to taking care of the dog's daily ample amount of exercise, activation and training. Carlo is clean inside and in a foster home in Pirkkala, where you can get to know the boy as agreed.","shelter_id":"a61c415e-9c84-41bf-b6db-bbc1ad31b46f","images":[{"id":"f4beaddc-b470-4520-aade-d7b9af7a5114","url":"/rails/active_storage/disk/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaDdDVG9JYTJWNVNTSWhjR3R1YkdGd2NqWnlaVzgwZVhJeFluWXhZV016ZG1ReFpYUjRkd1k2QmtWVU9oQmthWE53YjNOcGRHbHZia2tpUjJsdWJHbHVaVHNnWm1sc1pXNWhiV1U5SWtOaGNteHZMWE5wZG5VdWFuQm5JanNnWm1sc1pXNWhiV1VxUFZWVVJpMDRKeWREWVhKc2J5MXphWFoxTG1wd1p3WTdCbFE2RVdOdmJuUmxiblJmZEhsd1pVa2lEMmx0WVdkbEwycHdaV2NHT3daVU9oRnpaWEoyYVdObFgyNWhiV1U2Q214dlkyRnMiLCJleHAiOiIyMDIyLTExLTA1VDE3OjE5OjM5LjAyMFoiLCJwdXIiOiJibG9iX2tleSJ9fQ==--d05688746c5720fb65e33dede253498f7c078fb8/Carlo-sivu.jpg","blurhash":"LBC7r:DkD~IBm.t7Rnoc.XkCssxt"},{"id":"ac4da65d-82d6-4242-ac11-effe579da0f1","url":"/rails/active_storage/disk/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaDdDVG9JYTJWNVNTSWhhbTB4T1hobWVHeDJPR1JtZVdabWEzcHZaSFJ2YW0xbGNtMW1aQVk2QmtWVU9oQmthWE53YjNOcGRHbHZia2tpUjJsdWJHbHVaVHNnWm1sc1pXNWhiV1U5SWtOaGNteHZMWFZ5YjNNdWFuQm5JanNnWm1sc1pXNWhiV1VxUFZWVVJpMDRKeWREWVhKc2J5MTFjbTl6TG1wd1p3WTdCbFE2RVdOdmJuUmxiblJmZEhsd1pVa2lEMmx0WVdkbEwycHdaV2NHT3daVU9oRnpaWEoyYVdObFgyNWhiV1U2Q214dlkyRnMiLCJleHAiOiIyMDIyLTExLTA1VDE3OjE5OjM5LjAyOFoiLCJwdXIiOiJibG9iX2tleSJ9fQ==--8af51df96b19c4c23dc7ccdb04d44562b7ef35ce/Carlo-uros.jpg","blurhash":"LFCGrR03NW-=xJkDxuR%y5t8xbM_"},{"id":"ab15e351-0804-4dd8-a6e8-223a64b296b1","url":"/rails/active_storage/disk/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaDdDVG9JYTJWNVNTSWhabTFqTlhGeGFqWXpjMmx3ZG01alptNXdOek0yZVRJMmNXODRhQVk2QmtWVU9oQmthWE53YjNOcGRHbHZia2tpUldsdWJHbHVaVHNnWm1sc1pXNWhiV1U5SW1OaGNteHZMWEJoWVM1cWNHY2lPeUJtYVd4bGJtRnRaU285VlZSR0xUZ25KMk5oY214dkxYQmhZUzVxY0djR093WlVPaEZqYjI1MFpXNTBYM1I1Y0dWSklnOXBiV0ZuWlM5cWNHVm5CanNHVkRvUmMyVnlkbWxqWlY5dVlXMWxPZ3BzYjJOaGJBPT0iLCJleHAiOiIyMDIyLTExLTA1VDE3OjE5OjM5LjAzMVoiLCJwdXIiOiJibG9iX2tleSJ9fQ==--5e00376f2707c1817d489f888856322eb89dc675/carlo-paa.jpg","blurhash":"LBC?u{0KNW-Y?Zxu?I9Fx=RQxcof"}]},{"id":"0c15a767-9c0b-432e-8c91-efba80978a6f","name":"Figo","species":"Multiracial","birthdate":"2022-07-23","sex":"male","description":"Multi-breed Figo is looking for a new home. Figo and his brother are a really fast couple that the owner had to give up due to a change in his own life situation. Figo is faster than the brothers, always the first in every place to cause different situations. Takes bigger ones to play with, bullies them and might command a bit if it feels like he's not being noticed otherwise. After receiving a rude objection, he quickly goes elsewhere to investigate the situation. Braver than his brother by nature, reacts to new situations by barking, quiets down when asked but also as soon as he realizes there is nothing to be afraid of. Gets along well with other dogs, cats and school-aged children. Puppies are placed separately and only with the female dog as a companion to avoid possible later problems. Traveling by car is fine, is not sick and knows how to be nice in his own transport box. Figo's parents are approx. 40 cm in size and weigh approx. 10-13 kg, so the puppies are expected to grow to be approximately the same size. Although Figo is a little smaller than his brother, the boy may also be smaller than expected. We are primarily looking for a home for Figo in a terraced house or detached house, and the future home requires a commitment to training, socializing the puppy and taking care of the dog's daily sufficient exercise and activation. The interior cleanliness is good, but damage still happens, so the future home must be prepared for this. Figo was brought privately from Poland and the dog has all the necessary documents in order. Figo is in a foster home in Pukkila, where you can get to know the boy as agreed. Figo's parents are approx. 40 cm in size and weigh approx. 10-13 kg, so the puppies are expected to grow to be approximately the same size. Although Figo is a little smaller than his brother, the boy may also be smaller than expected. We are primarily looking for a home for Figo in a terraced house or detached house, and the future home requires a commitment to training, socializing the puppy and taking care of the dog's daily sufficient exercise and activation. The interior cleanliness is good, but damage still happens, so the future home must be prepared for this. Figo was brought privately from Poland and the dog has all the necessary documents in order. Figo is in a foster home in Pukkila, where you can get to know the boy as agreed. Figo's parents are approx. 40 cm in size and weigh approx. 10-13 kg, so the puppies are expected to grow to be approximately the same size. Although Figo is a little smaller than his brother, the boy may also be smaller than expected. We are primarily looking for a home for Figo in a terraced house or detached house, and the future home requires a commitment to training, socializing the puppy and taking care of the dog's daily sufficient exercise and activation. The interior cleanliness is good, but damage still happens, so the future home must be prepared for this. Figo was brought privately from Poland and the dog has all the necessary documents in order. Figo is in a foster home in Pukkila, where you can get to know the boy as agreed. Although Figo is a little smaller than his brother, the boy may also be smaller than expected. We are primarily looking for a home for Figo in a terraced house or detached house, and the future home requires a commitment to training, socializing the puppy and taking care of the dog's daily sufficient exercise and activation. The interior cleanliness is good, but damage still happens, so the future home must be prepared for this. Figo was brought privately from Poland and the dog has all the necessary documents in order. Figo is in a foster home in Pukkila, where you can get to know the boy as agreed. Although Figo is a little smaller than his brother, the boy may also be smaller than expected. We are primarily looking for a home for Figo in a terraced house or detached house, and the future home requires a commitment to training, socializing the puppy and taking care of the dog's daily sufficient exercise and activation. The interior cleanliness is good, but damage still happens, so the future home must be prepared for this. Figo was brought privately from Poland and the dog has all the necessary documents in order. Figo is in a foster home in Pukkila, where you can get to know the boy as agreed. for socialization and to take care of the dog's daily sufficient exercise and activation. The interior cleanliness is good, but damage still happens, so the future home must be prepared for this. Figo was brought privately from Poland and the dog has all the necessary documents in order. Figo is in a foster home in Pukkila, where you can get to know the boy as agreed. for socialization and to take care of the dog's daily sufficient exercise and activation. The interior cleanliness is good, but damage still happens, so the future home must be prepared for this. Figo was brought privately from Poland and the dog has all the necessary documents in order. Figo is in a foster home in Pukkila, where you can get to know the boy as agreed.","shelter_id":"a61c415e-9c84-41bf-b6db-bbc1ad31b46f","images":[{"id":"32b29253-a153-47eb-8af5-d617c81e657d","url":"/rails/active_storage/disk/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaDdDVG9JYTJWNVNTSWhhRzl0Tlhjd2RISnROakEzTTJaNll6Vm9lSFk0TVhoaE5XbGlPUVk2QmtWVU9oQmthWE53YjNOcGRHbHZia2tpUTJsdWJHbHVaVHNnWm1sc1pXNWhiV1U5SWtacFoyOHRjR0ZoTG1wd1p5STdJR1pwYkdWdVlXMWxLajFWVkVZdE9DY25SbWxuYnkxd1lXRXVhbkJuQmpzR1ZEb1JZMjl1ZEdWdWRGOTBlWEJsU1NJUGFXMWhaMlV2YW5CbFp3WTdCbFE2RVhObGNuWnBZMlZmYm1GdFpUb0tiRzlqWVd3PSIsImV4cCI6IjIwMjItMTEtMDVUMTc6MTk6MzkuMDQ5WiIsInB1ciI6ImJsb2Jfa2V5In19--735b9092e66eef08ecaee06955ae07aa4c121aff/Figo-paa.jpg","blurhash":"LFH--_x[~UIVcCn,R%ofE2WCIot7"},{"id":"58800b78-419f-4547-9179-24a81ab38ff4","url":"/rails/active_storage/disk/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaDdDVG9JYTJWNVNTSWhNakY1YW5OdmIyMXdPV2x6TnpkamNYb3hhbXBpZFRJeVpqTTRNUVk2QmtWVU9oQmthWE53YjNOcGRHbHZia2tpUldsdWJHbHVaVHNnWm1sc1pXNWhiV1U5SWtacFoyOHRjMmwyZFM1cWNHY2lPeUJtYVd4bGJtRnRaU285VlZSR0xUZ25KMFpwWjI4dGMybDJkUzVxY0djR093WlVPaEZqYjI1MFpXNTBYM1I1Y0dWSklnOXBiV0ZuWlM5cWNHVm5CanNHVkRvUmMyVnlkbWxqWlY5dVlXMWxPZ3BzYjJOaGJBPT0iLCJleHAiOiIyMDIyLTExLTA1VDE3OjE5OjM5LjA1OVoiLCJwdXIiOiJibG9iX2tleSJ9fQ==--9b98fc42a545112197c1f30fcfdb20b7fe623909/Figo-sivu.jpg","blurhash":"L9D,#}?a?tt8.RbXWCRj_KxtH[V@"},{"id":"bb8cab4d-ddc4-4e61-ade8-cad74bf0ac3a","url":"/rails/active_storage/disk/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaDdDVG9JYTJWNVNTSWhiVE15YlhWd2VXOXhiSFJoY25sMk9YUTBhV1UwY1RNM2VIbG1jZ1k2QmtWVU9oQmthWE53YjNOcGRHbHZia2tpTzJsdWJHbHVaVHNnWm1sc1pXNWhiV1U5SWtacFoyOHVhbkJuSWpzZ1ptbHNaVzVoYldVcVBWVlVSaTA0SnlkR2FXZHZMbXB3WndZN0JsUTZFV052Ym5SbGJuUmZkSGx3WlVraUQybHRZV2RsTDJwd1pXY0dPd1pVT2hGelpYSjJhV05sWDI1aGJXVTZDbXh2WTJGcyIsImV4cCI6IjIwMjItMTEtMDVUMTc6MTk6MzkuMDY3WiIsInB1ciI6ImJsb2Jfa2V5In19--b2970fffc2de3108727b942de9cb78d82171b82c/Figo.jpg","blurhash":"LDEpTGf+y9IVO^V{MytM~o%fMeM{"},{"id":"965a1e03-171c-4c77-829a-d9886f69bc12","url":"/rails/active_storage/disk/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaDdDVG9JYTJWNVNTSWhlV3hvYldGM2RucGxNR2d6ZDJOaWIyOTZPR040WjJNNU1ucHllUVk2QmtWVU9oQmthWE53YjNOcGRHbHZia2tpVzJsdWJHbHVaVHNnWm1sc1pXNWhiV1U5SWxCbGJtNTFkQzFHYkc5cmFTMXFZUzFHYVdkdkxtcHdaeUk3SUdacGJHVnVZVzFsS2oxVlZFWXRPQ2NuVUdWdWJuVjBMVVpzYjJ0cExXcGhMVVpwWjI4dWFuQm5CanNHVkRvUlkyOXVkR1Z1ZEY5MGVYQmxTU0lQYVcxaFoyVXZhbkJsWndZN0JsUTZFWE5sY25acFkyVmZibUZ0WlRvS2JHOWpZV3c9IiwiZXhwIjoiMjAyMi0xMS0wNVQxNzoxOTozOS4wNzZaIiwicHVyIjoiYmxvYl9rZXkifX0=--ff63abaae309feedffba56ac2c5a9eb1863b1a5f/Pennut-Floki-ja-Figo.jpg","blurhash":"LBE{zTM~oyxv4ixtjwkE_3oyN2tS"}]}]}]
